ERM/src/Documents/ЗагрузкаДанныхCRMAccountsExtract.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗагрузкаДанныхCRMAccountsExtract</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRMAccountsExtractSourceData</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛистФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НовыеParentClients</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ParentClentAlias</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НовыеSalesКлиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ParentClient</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ParentClentAlias</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НовыеBillingКлиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ParentClient</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ParentClentAlias</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеCRMID</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OldCRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NewCRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеBillingID</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OldBillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NewOldBillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеParentClients</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>CRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OldParentClient</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NewParentClient</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ParentClentAlias</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/InformationRegisters/НастройкаСинхронизацииОбъектовСВнешнимиСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСинхронизацииОбъектовСВнешнимиСистемами</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектПриемника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/ИерархияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ИерархияКонтрагентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/ДублиBillingID/ДублиBillingID.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДублиBillingID</name>
  <dimensions>
    <name>Client</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/InformationRegisters/ЛогиЗагрузкиCRMAccountsExtract.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЛогиЗагрузкиCRMAccountsExtract</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRMID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументЗагрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаДанныхCRMAccountsExtract</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеЛогирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияЛогированияCRMAccountsExtractLoading</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСобытия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Enums/ТипыСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСоответствий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Lawson</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleSmith</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HOBs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьCRM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьParentClients</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sun</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Enums/ТипыОбъектовВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыОбъектовВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Client</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Segment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Geomarket</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Currency</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountingUnit</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Account</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Company</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Location</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LegalEntity</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Enums/СостоянияАктивностиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СостоянияАктивностиКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неактивен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетАктивации</Name>
					<Comment>Pre-active</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Enums/ТипыКлиентов/ТипыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКлиентов</name>
  <enumValues>
    <name>BillingAccount</name>
  </enumValues>
  <enumValues>
    <name>SalesAccount</name>
  </enumValues>
  <enumValues>
    <name>ParentAccount</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Documents/ЗагрузкаДанныхCRMAccountsExtract/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СоздатьНовыеОбъекты(Отказ);
	ОбработатьИзмененныеОбъекты(Отказ);
	ОбработатьИзменныеРеквизиты(Отказ);
	ДеактивироватьОтсутствующихКлиентов(Отказ);
	
КонецПроцедуры

Процедура СоздатьНовыеОбъекты(Отказ)
	
	//НЗ_ParentClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	//НЗ_ParentClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.ParentClients);
	//НЗ_ParentClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	//НЗ_SalesClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	//НЗ_SalesClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.CRM);
	//НЗ_SalesClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_LawsonClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_LawsonClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.Lawson);
	НЗ_LawsonClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_MIClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_MIClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.OracleMI);
	НЗ_MIClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_SmithClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_SmithClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.OracleSmith);
	НЗ_SmithClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_ИерархияКонтрагентов = РегистрыСведений.ИерархияКонтрагентов.СоздатьНаборЗаписей();
	НЗ_ИерархияКонтрагентов.Отбор.Период.Установить(Дата);
	
	НЗ_ДублиBillingID = РегистрыСведений.ДублиBillingID.СоздатьНаборЗаписей();
	
	СтруктураЗаписиЛогов = Новый Структура("ДокументЗагрузки, ДатаСобытия, СобытиеЛогирования, Пользователь, CRMID, Client, Текст");
	СтруктураЗаписиЛогов.ДокументЗагрузки = Ссылка;
	СтруктураЗаписиЛогов.ДатаСобытия = ТекущаяДата();
	СтруктураЗаписиЛогов.Пользователь = Пользователи.ТекущийПользователь();
	
	// новые parent clients
	СозданныеParentClients = Новый Соответствие;
	Для каждого ТекСтрокаТЧ Из НовыеParentClients Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
		НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
		//НовыйКонтагент.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
		НовыйКонтагент.СостояниеАктивности = Перечисления.СостоянияАктивностиКонтрагентов.ОжидаетАктивации;
		НовыйКонтагент.AccountType = Перечисления.ТипыКлиентов.ParentAccount;
		НовыйКонтагент.Записать();
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.СозданиеParentClient;
		//СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
		СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
		СозданныеParentClients.Вставить(ТекСтрокаТЧ.Description, НовыйКонтагент.Ссылка);
		
	КонецЦикла;
	
	// новые Sales клиенты
	//ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(НовыеSalesКлиенты.ВыгрузитьКолонку("ParentClientDescription"));
	
	Для каждого ТекСтрокаТЧ Из НовыеSalesКлиенты Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		//Если СозданныеParentClients[ТекСтрокаТЧ.CRMID] = Неопределено Тогда
			
			НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйКонтагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
			//НовыйКонтагент.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
			НовыйКонтагент.СостояниеАктивности = Перечисления.СостоянияАктивностиКонтрагентов.ОжидаетАктивации;
			//НовыйКонтагент.CreditRating = ТекСтрокаТЧ.УдалитьCreditRating;
			НовыйКонтагент.AccountType = Перечисления.ТипыКлиентов.SalesAccount;
			НовыйКонтагент.Записать();
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.СозданиеSalesClient;
			//СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		//Иначе
		//	
		//	НовыйКонтагентСсылка = СозданныеParentClients[ТекСтрокаТЧ.CRMID];
		//	НовыйКонтагент = НовыйКонтагентСсылка.ПолучитьОбъект();
		//	НовыйКонтагент.CreditRating = ТекСтрокаТЧ.CreditRating;
		//	НовыйКонтагент.Записать();
		//	
		//	// логирование события
		//	СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
		//	СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		//	СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		//	СтруктураЗаписиЛогов.Текст = "Update credit rating";
		//	ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		//	
		//КонецЕсли;
		
		//НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.CRMID);
		//НЗ_SalesClients.Очистить();
		//НоваяЗапись = НЗ_SalesClients.Добавить();
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.CRM;
		//НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		//НоваяЗапись.Идентификатор = ТекСтрокаТЧ.CRMID;
		//НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		//НЗ_SalesClients.Записать();
		
		// { RGS AGorlenko 20.03.2018 13:51:40 - изменение сэйлз аккаунтов
		
		// } RGS AGorlenko 20.03.2018 13:52:05 - изменение сэйлз аккаунтов
		//ПустойID = "#empty#" + ТекСтрокаТЧ.УдалитьCRMID;
		//
		//// Lawson
		//НЗ_LawsonClients.Отбор.Идентификатор.Установить(ПустойID);
		//НЗ_LawsonClients.Очистить();
		//НоваяЗапись = НЗ_LawsonClients.Добавить();
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
		//НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		//НоваяЗапись.Идентификатор = ПустойID;
		//НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		//НЗ_LawsonClients.Записать(Ложь);
		//
		//// логирование события
		//СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
		//СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
		//СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		//СтруктураЗаписиЛогов.Текст = "Update Lawson ID";
		//ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		//
		//// MI
		//НЗ_MIClients.Отбор.Идентификатор.Установить(ПустойID);
		//НЗ_MIClients.Очистить();
		//НоваяЗапись = НЗ_MIClients.Добавить();
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI;
		//НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		//НоваяЗапись.Идентификатор = ПустойID;
		//НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		//НЗ_MIClients.Записать(Ложь);
		//
		//// логирование события
		//СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
		//СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
		//СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		//СтруктураЗаписиЛогов.Текст = "Update MI ID";
		//ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		//	
		//// SMITH
		//НЗ_SmithClients.Отбор.Идентификатор.Установить(ПустойID);
		//НЗ_SmithClients.Очистить();
		//НоваяЗапись = НЗ_SmithClients.Добавить();
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith;
		//НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		//НоваяЗапись.Идентификатор = ПустойID;
		//НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		//НЗ_SmithClients.Записать(Ложь);
		//
		//// логирование события
		//СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
		//СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
		//СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		//СтруктураЗаписиЛогов.Текст = "Update SMITH ID";
		//ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		//	
		//НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(НовыйКонтагент.Ссылка);
		//НЗ_ИерархияКонтрагентов.Очистить();
		//НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.Контрагент = НовыйКонтагент.Ссылка;
		//ГоловнойКонтрагент = ГоловныеКонтрагенты[ТекСтрокаТЧ.УдалитьParentClientDescription];
		//Если ГоловнойКонтрагент = Неопределено Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find parent client by ID '" + ТекСтрокаТЧ.УдалитьParentClientDescription + "'",,,,Отказ);
		//КонецЕсли;
		//НоваяЗапись.ГоловнойКонтрагент = ГоловнойКонтрагент;
		//НЗ_ИерархияКонтрагентов.Записать();
		//
		//// логирование события
		//СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеParentClient;
		//СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
		//СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		//СтруктураЗаписиЛогов.Текст = "Update parent client. Value: " + ГоловнойКонтрагент;
		//ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
	КонецЦикла;
	
	// новые Billing клиенты
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(НовыеBillingКлиенты.ВыгрузитьКолонку("ParentClientDescription"));
	SalesAccounts = ПолучитьSalesAccounts(НовыеBillingКлиенты.ВыгрузитьКолонку("SalesAccountDescription"));
	
	Для каждого ТекСтрокаТЧ Из НовыеBillingКлиенты Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		//Если СозданныеParentClients[ТекСтрокаТЧ.CRMID] = Неопределено Тогда
			
			НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйКонтагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
			НовыйКонтагент.CRMID = ТекСтрокаТЧ.CRMID;
			НовыйКонтагент.СостояниеАктивности = Перечисления.СостоянияАктивностиКонтрагентов.ОжидаетАктивации;
			НовыйКонтагент.CreditRating = ТекСтрокаТЧ.CreditRating;
			НовыйКонтагент.AccountType = Перечисления.ТипыКлиентов.BillingAccount;
			НовыйКонтагент.Записать();
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.СозданиеBillingClient;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		//Иначе
		//	
		//	НовыйКонтагентСсылка = СозданныеParentClients[ТекСтрокаТЧ.CRMID];
		//	НовыйКонтагент = НовыйКонтагентСсылка.ПолучитьОбъект();
		//	НовыйКонтагент.CreditRating = ТекСтрокаТЧ.CreditRating;
		//	НовыйКонтагент.Записать();
		//	
		//	// логирование события
		//	СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
		//	СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		//	СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		//	СтруктураЗаписиЛогов.Текст = "Update credit rating";
		//	ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		//	
		//КонецЕсли;
		
		//НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.CRMID);
		//НЗ_SalesClients.Очистить();
		//НоваяЗапись = НЗ_SalesClients.Добавить();
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.CRM;
		//НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		//НоваяЗапись.Идентификатор = ТекСтрокаТЧ.CRMID;
		//НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		//НЗ_SalesClients.Записать();
		
		// Lawson
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.LawsonID
			, Перечисления.ТипыСоответствий.Lawson
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
			
		Если Не ПустаяСтрока(ТекСтрокаТЧ.LawsonID) И НЕ ОбъектЕстьВРегистре Тогда
			
			НЗ_LawsonClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.LawsonID);
			НЗ_LawsonClients.Очистить();
			НоваяЗапись = НЗ_LawsonClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.LawsonID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_LawsonClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ПустаяСтрока(ТекСтрокаТЧ.LawsonID) И Не ОбъектЕстьВРегистре Тогда
			
			ПустойID = "#empty#" + ТекСтрокаТЧ.CRMID;
			
			НЗ_LawsonClients.Отбор.Идентификатор.Установить(ПустойID);
			НЗ_LawsonClients.Очистить();
			НоваяЗапись = НЗ_LawsonClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ПустойID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_LawsonClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(НовыйКонтагент.Ссылка);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = НовыйКонтагент.Ссылка;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Double Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		// MI
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.MIID
			, Перечисления.ТипыСоответствий.OracleMI
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
		
		Если Не ПустаяСтрока(ТекСтрокаТЧ.MIID) И НЕ ОбъектЕстьВРегистре Тогда
				
			НЗ_MIClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.MIID);
			НЗ_MIClients.Очистить();
			НоваяЗапись = НЗ_MIClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.MIID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_MIClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ПустаяСтрока(ТекСтрокаТЧ.MIID) И НЕ ОбъектЕстьВРегистре Тогда
			
			ПустойID = "#empty#" + ТекСтрокаТЧ.CRMID;
			
			НЗ_MIClients.Отбор.Идентификатор.Установить(ПустойID);
			НЗ_MIClients.Очистить();
			НоваяЗапись = НЗ_MIClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ПустойID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_MIClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(НовыйКонтагент.Ссылка);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = НовыйКонтагент.Ссылка;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Double MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		// SMITH
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.SMITHID
			, Перечисления.ТипыСоответствий.OracleSmith
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
		
		Если Не ПустаяСтрока(ТекСтрокаТЧ.SMITHID) И Не ОбъектЕстьВРегистре Тогда
				
			НЗ_SmithClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.SMITHID);
			НЗ_SmithClients.Очистить();
			НоваяЗапись = НЗ_SmithClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.SMITHID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_SmithClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ПустаяСтрока(ТекСтрокаТЧ.SMITHID) И Не ОбъектЕстьВРегистре Тогда
			
			ПустойID = "#empty#" + ТекСтрокаТЧ.CRMID;
			
			НЗ_SmithClients.Отбор.Идентификатор.Установить(ПустойID);
			НЗ_SmithClients.Очистить();
			НоваяЗапись = НЗ_SmithClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ПустойID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_SmithClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(НовыйКонтагент.Ссылка);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = НовыйКонтагент.Ссылка;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Double SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(НовыйКонтагент.Ссылка);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = НовыйКонтагент.Ссылка;
		ГоловнойКонтрагент = ГоловныеКонтрагенты[ВРЕГ(ТекСтрокаТЧ.ParentClientDescription)];
		Если ГоловнойКонтрагент = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find parent client by ID '" + ТекСтрокаТЧ.ParentClientDescription + "'",,,,Отказ);
		КонецЕсли;
		НоваяЗапись.ГоловнойКонтрагент = ГоловнойКонтрагент;
		SalesAccount = SalesAccounts[ВРЕГ(ТекСтрокаТЧ.SalesAccountDescription)];
		Если SalesAccount = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find sales account by ID '" + ТекСтрокаТЧ.SalesAccountDescription + "'",,,,Отказ);
		КонецЕсли;
		НоваяЗапись.SalesAccount = SalesAccount;
		НЗ_ИерархияКонтрагентов.Записать();
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеParentClient;
		СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		СтруктураЗаписиЛогов.Текст = "Update parent client. Value: " + ГоловнойКонтрагент + ". Update sales account. Value: " + SalesAccount;
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзмененныеОбъекты(Отказ)
	
	//НЗ_SalesClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	//НЗ_SalesClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.CRM);
	//НЗ_SalesClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_LawsonClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_LawsonClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.Lawson);
	НЗ_LawsonClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_MIClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_MIClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.OracleMI);
	НЗ_MIClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_SmithClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_SmithClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.OracleSmith);
	НЗ_SmithClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_ИерархияКонтрагентов = РегистрыСведений.ИерархияКонтрагентов.СоздатьНаборЗаписей();
	НЗ_ИерархияКонтрагентов.Отбор.Период.Установить(Дата);
	
	НЗ_ДублиBillingID = РегистрыСведений.ДублиBillingID.СоздатьНаборЗаписей();
	
	СтруктураЗаписиЛогов = Новый Структура("ДокументЗагрузки, ДатаСобытия, СобытиеЛогирования, Пользователь, CRMID, Client, Текст");
	СтруктураЗаписиЛогов.ДокументЗагрузки = Ссылка;
	СтруктураЗаписиЛогов.ДатаСобытия = ТекущаяДата();
	СтруктураЗаписиЛогов.Пользователь = Пользователи.ТекущийПользователь();
	
	//Для каждого ТекСтрокаТЧ Из ИзмененныеCRMID Цикл
	//	
	//	Если Не ТекСтрокаТЧ.Применить Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewCRMID);
	//	НЗ_SalesClients.Очистить();
	//	НоваяЗапись = НЗ_SalesClients.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.CRM;
	//	НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
	//	НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewCRMID;
	//	НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
	//	НЗ_SalesClients.Записать();
	//	
	//КонецЦикла;
	
	Для каждого ТекСтрокаТЧ Из ИзмененныеBillingID Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		// Lawson
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.NewLawsonID
			, Перечисления.ТипыСоответствий.Lawson
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
			
		Если ТекСтрокаТЧ.NewLawsonID <> ТекСтрокаТЧ.OldLawsonID И НЕ ОбъектЕстьВРегистре Тогда
				
			НЗ_LawsonClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewLawsonID);
			НЗ_LawsonClients.Очистить();
			НоваяЗапись = НЗ_LawsonClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewLawsonID;
			НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
			НЗ_LawsonClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(ТекСтрокаТЧ.Client);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = ТекСтрокаТЧ.Client;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Double Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		// MI
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.NewMIID
			, Перечисления.ТипыСоответствий.OracleMI
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
			
		Если ТекСтрокаТЧ.NewMIID <> ТекСтрокаТЧ.OldMIID И НЕ ОбъектЕстьВРегистре Тогда
				
			НЗ_MIClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewMIID);
			НЗ_MIClients.Очистить();
			НоваяЗапись = НЗ_MIClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewMIID;
			НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
			НЗ_MIClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(ТекСтрокаТЧ.Client);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = ТекСтрокаТЧ.Client;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Double MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		// Smith
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.NewSmithID
			, Перечисления.ТипыСоответствий.OracleSmith
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
			
		Если ТекСтрокаТЧ.NewSmithID <> ТекСтрокаТЧ.OldSmithID И НЕ ОбъектЕстьВРегистре Тогда
				
			НЗ_SmithClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewSmithID);
			НЗ_SmithClients.Очистить();
			НоваяЗапись = НЗ_SmithClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewSmithID;
			НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
			НЗ_SmithClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(ТекСтрокаТЧ.Client);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = ТекСтрокаТЧ.Client;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Double SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// для пустых новых головных контрагентов попробуем найти их по идентификаторам
	НайденныеСтроки = ИзмененныеParentClients.НайтиСтроки(Новый Структура("Применить, NewParentClient", Истина, Справочники.Контрагенты.ПустаяСсылка()));
	МассивИдентификаторов = Новый Массив;
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивИдентификаторов.Добавить(НайденнаяСтрока.NewParentClientDescription);
	КонецЦикла;
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(МассивИдентификаторов);
	
	НайденныеСтроки = ИзмененныеParentClients.НайтиСтроки(Новый Структура("Применить, NewSalesAccount", Истина, Справочники.Контрагенты.ПустаяСсылка()));
	МассивИдентификаторов = Новый Массив;
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивИдентификаторов.Добавить(НайденнаяСтрока.NewSalesAccountDescription);
	КонецЦикла;
	SalesAccounts = ПолучитьSalesAccounts(МассивИдентификаторов);
	
	Для каждого ТекСтрокаТЧ Из ИзмененныеParentClients Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаТЧ.NewParentClient.Пустая() И НЕ ПустаяСтрока(ТекСтрокаТЧ.NewParentClientDescription) Тогда
			// попытаемся найти по идентификатору
			NewParentClient = ГоловныеКонтрагенты[ВРЕГ(ТекСтрокаТЧ.NewParentClientDescription)];
		Иначе
			NewParentClient = ТекСтрокаТЧ.NewParentClient;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(NewParentClient) И НЕ ПустаяСтрока(ТекСтрокаТЧ.NewParentClientDescription) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find new parent client for '" + ТекСтрокаТЧ.Client + "'",,,, Отказ);
		КонецЕсли;
		
		Если ТекСтрокаТЧ.NewSalesAccount.Пустая() И НЕ ПустаяСтрока(ТекСтрокаТЧ.NewSalesAccountDescription) Тогда
			// попытаемся найти по идентификатору
			NewSalesAccount = SalesAccounts[ВРЕГ(ТекСтрокаТЧ.NewSalesAccountDescription)];
		Иначе
			NewSalesAccount = ТекСтрокаТЧ.NewSalesAccount;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(NewSalesAccount) И НЕ ПустаяСтрока(ТекСтрокаТЧ.NewSalesAccountDescription) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find new sales account for '" + ТекСтрокаТЧ.Client + "'",,,, Отказ);
		КонецЕсли;
		
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(ТекСтрокаТЧ.Client);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = ТекСтрокаТЧ.Client;
		НоваяЗапись.ГоловнойКонтрагент = NewParentClient;
		НоваяЗапись.SalesAccount = NewSalesAccount;
		НЗ_ИерархияКонтрагентов.Записать();
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеParentClient;
		СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
		СтруктураЗаписиЛогов.Текст = "Update parent client. New value: " + NewParentClient;
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзменныеРеквизиты(Отказ)
	
	СтруктураЗаписиЛогов = Новый Структура("ДокументЗагрузки, ДатаСобытия, СобытиеЛогирования, Пользователь, CRMID, Client, Текст");
	СтруктураЗаписиЛогов.ДокументЗагрузки = Ссылка;
	СтруктураЗаписиЛогов.ДатаСобытия = ТекущаяДата();
	СтруктураЗаписиЛогов.Пользователь = Пользователи.ТекущийПользователь();
	
	ДанныеЗаполенияКИ = Новый ТаблицаЗначений;
	ДанныеЗаполенияКИ.Колонки.Добавить("Приемник");
	ДанныеЗаполенияКИ.Колонки.Добавить("ВидКИ");
	ДанныеЗаполенияКИ.Колонки.Добавить("СтруктураКИ");
	ДанныеЗаполенияКИ.Колонки.Добавить("КлючСтроки");
	
	Для каждого СтрокаТЧ Из ИзмененныеРеквизиты Цикл
		
		Если Не СтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		ТекОбъект = СтрокаТЧ.Client.ПолучитьОбъект();
		ТекОбъект.Наименование = СтрокаТЧ.NewDescription;
		ТекОбъект.CreditRating = СтрокаТЧ.NewCreditRating;
		
		ТекОбъект.crmCountry = СтрокаТЧ.NewCountry;
		ТекОбъект.crmCity = СтрокаТЧ.NewCity;
		ТекОбъект.crmStreetAddress = СтрокаТЧ.NewStreetAddress;
		ТекОбъект.crmPostalCode = СтрокаТЧ.NewPostalCode;
		
		ТекОбъект.Записать();
		
		// логирование события
		Если СтрокаТЧ.OldDescription <> СтрокаТЧ.NewDescription Тогда
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
			СтруктураЗаписиЛогов.CRMID = СтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update description";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		КонецЕсли;
		
		Если СтрокаТЧ.OldCreditRating <> СтрокаТЧ.NewCreditRating Тогда
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
			СтруктураЗаписиЛогов.CRMID = СтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update credit rating";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		КонецЕсли;
		
		Если СтрокаТЧ.OldCountry <> СтрокаТЧ.NewCountry Тогда
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
			СтруктураЗаписиЛогов.CRMID = СтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update Country";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		КонецЕсли;
		
		Если СтрокаТЧ.OldCity <> СтрокаТЧ.NewCity Тогда
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
			СтруктураЗаписиЛогов.CRMID = СтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update City";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		КонецЕсли;
		
		Если СтрокаТЧ.OldStreetAddress <> СтрокаТЧ.NewStreetAddress Тогда
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
			СтруктураЗаписиЛогов.CRMID = СтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update Street Address";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		КонецЕсли;
		
		Если СтрокаТЧ.OldPostalCode <> СтрокаТЧ.NewPostalCode Тогда
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
			СтруктураЗаписиЛогов.CRMID = СтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update Postal Code";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		КонецЕсли;
		
		СтрокаКИ = ДанныеЗаполенияКИ.Добавить();
		СтрокаКИ.Приемник = СтрокаТЧ.Client;
		СтрокаКИ.ВидКИ = Справочники.ВидыКонтактнойИнформации.CRMАдресКонтрагента;
		СтрокаКИ.СтруктураКИ = Новый Структура("Страна, Индекс, Город, Улица", СтрокаТЧ.NewCountry, СтрокаТЧ.NewPostalCode, СтрокаТЧ.NewCity, СтрокаТЧ.NewStreetAddress);
		
	КонецЦикла;
	
	УправлениеКонтактнойИнформацией.ЗаполнитьКонтактнуюИнформациюОбъектов(ДанныеЗаполенияКИ);
	
КонецПроцедуры

Процедура ДеактивироватьОтсутствующихКлиентов(Отказ)
	
	СтруктураЗаписиЛогов = Новый Структура("ДокументЗагрузки, ДатаСобытия, СобытиеЛогирования, Пользователь, CRMID, Client, Текст");
	СтруктураЗаписиЛогов.ДокументЗагрузки = Ссылка;
	СтруктураЗаписиЛогов.ДатаСобытия = ТекущаяДата();
	СтруктураЗаписиЛогов.Пользователь = Пользователи.ТекущийПользователь();
	
	Для каждого СтрокаТЧ Из КлиентыДляДективации Цикл
		
		ТекОбъект = СтрокаТЧ.Client.ПолучитьОбъект();
		ТекОбъект.СостояниеАктивности = Перечисления.СостоянияАктивностиКонтрагентов.Неактивен;
		ТекОбъект.ДатаДеактивации = Дата;
		ТекОбъект.Записать();
		
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ДеактивацияКлиента;
		СтруктураЗаписиЛогов.CRMID = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Client, "CRMID");
		СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьГоловныхКонтрагентов(МассивИдентификаторов)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК ОбъектПриемника,
		|	Контрагенты.Наименование КАК Идентификатор
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.Наименование В(&МассивИдентификаторов)
		|	И Контрагенты.AccountType = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ParentAccount)";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(ВРЕГ(Выборка.Идентификатор), Выборка.ОбъектПриемника);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьSalesAccounts(МассивИдентификаторов)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК ОбъектПриемника,
		|	Контрагенты.Наименование КАК Идентификатор
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.Наименование В(&МассивИдентификаторов)
		|	И Контрагенты.AccountType = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.SalesAccount)";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(ВРЕГ(Выборка.Идентификатор), Выборка.ОбъектПриемника);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Проведен Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to save posted document");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗалогироватьСобытие(СтруктураЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.ЛогиЗагрузкиCRMAccountsExtract.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	МенеджерЗаписи.ИдентификаторСобытия = Новый УникальныйИдентификатор();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
